def format_post(post):
    return f"""🖱 שליטה מדויקת, מגע חלק!
טרקפד בלוטות' איכותי – תומך מולטי טאץ' ל-Windows/Mac

🔸 משטח זכוכית חלק עם חיישנים רגישים
🔸 חיבור אלחוטי או חוטי USB
🔸 מתאים לכל מחשב נייד ונייח

👇🛍הזמינו עכשיו🛍👇
{post['link']}
מחיר מבצע {post['sale_price']} ₪
(מחיר מקורי {post['original_price']} ₪)
🖲 חסכון של {post['discount']}%
📊 דירוג: {post['rating']}%
📦 {post['orders']} הזמנות
🚚 משלוח חינם בהזמנות מעל 38 ₪ או 7.49 ₪

להזמנה מהירה לחצו כאן👉
{post['link']}
מספר פריט: {post['id']}
להצטרפות לערוץ לחצו עליי👉
https://t.me/+LlMY8B9soOdhNmZk
כל המחירים והמבצעים תקפים למועד הפרסום ועשויים להשתנות.
"""